
===========================================================================
report_tns
============================================================================
tns -12.14

===========================================================================
report_wns
============================================================================
wns -0.87

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.87

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.32
