
===========================================================================
report_tns
============================================================================
tns -1.20

===========================================================================
report_wns
============================================================================
wns -0.37

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.37

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.31
