###############################################################################
# Created by write_sdc
# Sun May 25 14:06:27 2025
###############################################################################
current_design ZeroToFiveCounter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
