
===========================================================================
report_tns
============================================================================
tns -276.64

===========================================================================
report_wns
============================================================================
wns -9.61

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -9.61

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
