
===========================================================================
report_tns
============================================================================
tns -294.54

===========================================================================
report_wns
============================================================================
wns -10.26

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.26

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.12
