
===========================================================================
report_tns
============================================================================
tns -10.52

===========================================================================
report_wns
============================================================================
wns -0.67

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.67

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.27
