
===========================================================================
report_tns
============================================================================
tns -312.70

===========================================================================
report_wns
============================================================================
wns -10.93

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.93

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.09
