
===========================================================================
report_tns
============================================================================
tns -8.03

===========================================================================
report_wns
============================================================================
wns -0.58

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.58

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.28
