
===========================================================================
report_tns
============================================================================
tns -278.68

===========================================================================
report_wns
============================================================================
wns -9.49

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -9.49

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.13
