
===========================================================================
report_tns
============================================================================
tns -97.43

===========================================================================
report_wns
============================================================================
wns -3.45

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -3.45

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.29
