
===========================================================================
report_tns
============================================================================
tns -317.25

===========================================================================
report_wns
============================================================================
wns -10.83

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.83

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.03
