
===========================================================================
report_tns
============================================================================
tns -9.80

===========================================================================
report_wns
============================================================================
wns -2.55

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.55

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.11
