###############################################################################
# Created by write_sdc
# Fri May 30 22:21:41 2025
###############################################################################
current_design top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A1[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A2[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A3[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WD3[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WE3}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {opcode[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {alu_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {alu_out[31]}]
set_load -pin_load 0.0334 [get_ports {alu_out[30]}]
set_load -pin_load 0.0334 [get_ports {alu_out[29]}]
set_load -pin_load 0.0334 [get_ports {alu_out[28]}]
set_load -pin_load 0.0334 [get_ports {alu_out[27]}]
set_load -pin_load 0.0334 [get_ports {alu_out[26]}]
set_load -pin_load 0.0334 [get_ports {alu_out[25]}]
set_load -pin_load 0.0334 [get_ports {alu_out[24]}]
set_load -pin_load 0.0334 [get_ports {alu_out[23]}]
set_load -pin_load 0.0334 [get_ports {alu_out[22]}]
set_load -pin_load 0.0334 [get_ports {alu_out[21]}]
set_load -pin_load 0.0334 [get_ports {alu_out[20]}]
set_load -pin_load 0.0334 [get_ports {alu_out[19]}]
set_load -pin_load 0.0334 [get_ports {alu_out[18]}]
set_load -pin_load 0.0334 [get_ports {alu_out[17]}]
set_load -pin_load 0.0334 [get_ports {alu_out[16]}]
set_load -pin_load 0.0334 [get_ports {alu_out[15]}]
set_load -pin_load 0.0334 [get_ports {alu_out[14]}]
set_load -pin_load 0.0334 [get_ports {alu_out[13]}]
set_load -pin_load 0.0334 [get_ports {alu_out[12]}]
set_load -pin_load 0.0334 [get_ports {alu_out[11]}]
set_load -pin_load 0.0334 [get_ports {alu_out[10]}]
set_load -pin_load 0.0334 [get_ports {alu_out[9]}]
set_load -pin_load 0.0334 [get_ports {alu_out[8]}]
set_load -pin_load 0.0334 [get_ports {alu_out[7]}]
set_load -pin_load 0.0334 [get_ports {alu_out[6]}]
set_load -pin_load 0.0334 [get_ports {alu_out[5]}]
set_load -pin_load 0.0334 [get_ports {alu_out[4]}]
set_load -pin_load 0.0334 [get_ports {alu_out[3]}]
set_load -pin_load 0.0334 [get_ports {alu_out[2]}]
set_load -pin_load 0.0334 [get_ports {alu_out[1]}]
set_load -pin_load 0.0334 [get_ports {alu_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WE3}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
