
===========================================================================
report_tns
============================================================================
tns -12.67

===========================================================================
report_wns
============================================================================
wns -1.00

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.00

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.27
