
===========================================================================
report_tns
============================================================================
tns -8.01

===========================================================================
report_wns
============================================================================
wns -2.16

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.16

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.10
