
===========================================================================
report_tns
============================================================================
tns -298.34

===========================================================================
report_wns
============================================================================
wns -10.18

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -10.18

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.14
