
===========================================================================
report_tns
============================================================================
tns -680.36

===========================================================================
report_wns
============================================================================
wns -4.99

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.99

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.32
